
public class MyHomeClass {
	public static void main(String[] args) {
		System.out.println("여기는 나의 편한 집입니다.");
		// 집에서 작업하면, 시간이 걸리더라도 편하고 많이 작업할 수 있습니다.
		// 단점도 있지요. 항상 일을 생각하고 있어야 한다는 점입니다. 그것이 장점일 수도 있습니다.
		// 바로 창의적인 산물을 생성할 수 있으니까요.
		// 내용변경 후에는 커밋을 잘하고, master해서 push 해야만 합니다.
		// 사용법은 차츰 익숙해 지겠지요.
		// 커밋을 너무 자주하면, 깃이 싫어 할까요? 아니면, 다른 사람들이 불편해 할까요? 
		// 커밋만 하고 push 하지 않고 수정했습니다.
		// eclipse와 fork가 궁합이 잘 맞는군요. 이러한 상황을 모두 고려하여 편의성을 높인 제품입니다.
		// 지금 지연시간을 확인해 보니, eclipse 수정/저장후, 약 10초정도 지연되고 나서 fork가 인식하는 군요.
		// 곧바로 인식할 때도 있고, 조금 늦을때도 있나 봅니다.
		//
		/* 학원으로 옮겨 왔습니다. 포맷을 해놓았기 때문에 새로 모두 설치하였습니다.
		 * 결국, java17, eclipse, fork를 설치하고, 셋업을 다시 학습해봅니다.
		 * 
		 * 이것도 모두 과정입니다. 단추를 잘 끼워야 한참진행되는 중간에 시행착오를 하지 않을 수 있지요.
		 */
	}

}
